#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_caller_identity.current: Reading...
aws_security_group.drift-sg: Refreshing state... [id=sg-0bb400c33e629be81]
aws_security_group.web-node: Refreshing state... [id=sg-02b8e62f7e09faf7d]
aws_ecs_task_definition.service: Refreshing state... [id=service]
aws_security_group.bad-sg: Refreshing state... [id=sg-0ae45b25bc0314e64]
data.aws_caller_identity.current: Read complete after 0s [id=820379311794]
aws_s3_bucket.bhp: Refreshing state... [id=820379311794-acme-dev-bhp-bucket]
aws_s3_bucket.data: Refreshing state... [id=820379311794-acme-dev-data]
aws_s3_bucket.financials: Refreshing state... [id=820379311794-acme-dev-customer-financial-bucket]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_s3_bucket.bhp will be updated in-place
  ~ resource "aws_s3_bucket" "bhp" {
        id                          = "820379311794-acme-dev-bhp-bucket"
      ~ tags                        = {
          + "yor_trace"   = ""
            # (5 unchanged elements hidden)
        }
      ~ tags_all                    = {
          + "yor_trace"   = (known after apply)
            # (5 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_s3_bucket.bhpdemo will be created
  + resource "aws_s3_bucket" "bhpdemo" {
      + acceleration_status         = (known after apply)
      + acl                         = "public-read"
      + arn                         = (known after apply)
      + bucket                      = "820379311794-acme-dev-bhp-bucket2"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "820379311794-acme-dev"
          + "Name"        = "820379311794-acme-dev-bhp2"
          + "customer"    = "BHP-IaC-Demo2"
          + "git_org"     = "davesc63"
          + "git_repo"    = "Prisma-Cloud-IaC-Demo"
          + "yor_trace"   = ""
        }
      + tags_all                    = {
          + "Environment" = "820379311794-acme-dev"
          + "Name"        = "820379311794-acme-dev-bhp2"
          + "customer"    = "BHP-IaC-Demo2"
          + "git_org"     = "davesc63"
          + "git_repo"    = "Prisma-Cloud-IaC-Demo"
          + "yor_trace"   = (known after apply)
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = (known after apply)

              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  + sse_algorithm     = (known after apply)
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.

Warning: Argument is deprecated

  with aws_s3_bucket.data,
  on bad-s3.tf line 7, in resource "aws_s3_bucket" "data":
   7:   acl           = "private"

Use the aws_s3_bucket_acl resource instead

(and 7 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @davesc63, Action: `pull_request`*